stress.yaml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 60
      arrivalRate: 25
    - duration: 60
      arrivalRate: 50
    # - duration: 60
    #   arrivalRate: 75
    # - duration: 30
    #   arrivalRate: 100
  processor: "./generateRandomData.js"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Get Room"
    weight: 40
    flow:
      - loop:
          - function: generateRandomData
          - get:
              url: "/room/?id={{ randomId }}"
        count: 5
  - name: "Get bookings"
    weight: 40
    flow:
      - loop:
          - function: generateRandomData
          - get: 
              url: "/booking/?id={{ randomId }}"
        count: 5
  - name: "Make a booking"
    weight: 15
    flow:
      - loop:
          - function: generateRandomData
          - post: 
              url: "/booking?id={{ $randomNumber(1,10000000) }}"
              json:
                id: "{{ id }}"
                email: "{{ email }}"
                guest_adult: "{{ guest_adult }}"
                guest_child: "{{ guest_child }}"
                guest_infant: "{{ guest_infant }}"
                check_in: "{{ check_in }}"
                check_out: "{{ check_out }}"
                roomid: "{{ roomid }}"
        count: 2
          # - log: "Sent a request to /booking with {{ id }}, {{ email }}, {{ guest_adult }}, {{ guest_child }}, {{ guest_infant }}, {{ check_in }}, {{ check_out }}"